iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
};

#define DBGMCU (*(volatile struct DBGMCU_tag *) 0xe0042000)

struct RCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HSION:1;
      uint64_t HSIKERON:1;
      uint64_t HSIRDY:1;
      uint64_t reservedSpace1:5;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t HSECSSON:1;
      uint64_t reservedSpace2:4;
      uint64_t PLLSYSON:1;
      uint64_t PLLSYSRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t HSICAL0:8;
      uint64_t HSITRIM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:2;
      uint64_t SWS:2;
      uint64_t HPRE:4;
      uint64_t PPRE1:3;
      uint64_t PPRE2:3;
      uint64_t reservedSpace0:10;
      uint64_t MCOSEL:4;
      uint64_t MCOPRE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLSRC:2;
      uint64_t reservedSpace0:2;
      uint64_t PLLSYSM:4;
      uint64_t PLLSYSN:7;
      uint64_t reservedSpace1:1;
      uint64_t PLLPEN:1;
      uint64_t PLLSYSP:1;
      uint64_t reservedSpace2:2;
      uint64_t PLLSYSQEN:1;
      uint64_t PLLSYSQ:2;
      uint64_t reservedSpace3:1;
      uint64_t PLLSYSREN:1;
      uint64_t PLLSYSR:2;
      uint64_t PLLSYSPDIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSYSCFGR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t reservedSpace0:1;
      uint64_t HSIRDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t PLLSYSRDYIE:1;
      uint64_t reservedSpace1:3;
      uint64_t LSECSSIE:1;
      uint64_t RC48RDYIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYF:1;
      uint64_t LSERDYF:1;
      uint64_t reservedSpace0:1;
      uint64_t HSIRDYF:1;
      uint64_t HSERDYF:1;
      uint64_t PLLSYSRDYF:1;
      uint64_t reservedSpace1:2;
      uint64_t HSECSSF:1;
      uint64_t LSECSSF:1;
      uint64_t RC48RDYF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYC:1;
      uint64_t LSERDYC:1;
      uint64_t reservedSpace0:1;
      uint64_t HSIRDYC:1;
      uint64_t HSERDYC:1;
      uint64_t PLLSYSRDYC:1;
      uint64_t reservedSpace1:2;
      uint64_t HSECSSC:1;
      uint64_t LSECSSC:1;
      uint64_t RC48RDYC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CICR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1RST:1;
      uint64_t DMA2RST:1;
      uint64_t DMAMUX1RST:1;
      uint64_t CORDICRST:1;
      uint64_t MATRIXRST:1;
      uint64_t reservedSpace0:3;
      uint64_t FLITFRST:1;
      uint64_t reservedSpace1:3;
      uint64_t CRCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOARST:1;
      uint64_t GPIOBRST:1;
      uint64_t GPIOCRST:1;
      uint64_t GPIODRST:1;
      uint64_t GPIOERST:1;
      uint64_t GPIOFRST:1;
      uint64_t GPIOGRST:1;
      uint64_t reservedSpace0:6;
      uint64_t ADC12RST:1;
      uint64_t ADC345RST:1;
      uint64_t reservedSpace1:1;
      uint64_t DAC1RST:1;
      uint64_t DAC2RST:1;
      uint64_t DAC3RST:1;
      uint64_t DAC4RST:1;
      uint64_t reservedSpace2:4;
      uint64_t CRYPTRST:1;
      uint64_t reservedSpace3:1;
      uint64_t RNGRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCRST:1;
      uint64_t reservedSpace0:7;
      uint64_t QUADSPI1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3RSTR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t TIM3RST:1;
      uint64_t TIM4RST:1;
      uint64_t TIM5RST:1;
      uint64_t TIM6RST:1;
      uint64_t TIM7RST:1;
      uint64_t reservedSpace0:2;
      uint64_t CRSRST:1;
      uint64_t reservedSpace1:5;
      uint64_t SPI2RST:1;
      uint64_t SPI3RST:1;
      uint64_t reservedSpace2:1;
      uint64_t USART2RST:1;
      uint64_t USART3RST:1;
      uint64_t UART4RST:1;
      uint64_t UART5RST:1;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t USBDRST:1;
      uint64_t reservedSpace3:1;
      uint64_t FDCANRST:1;
      uint64_t reservedSpace4:2;
      uint64_t PWRRST:1;
      uint64_t reservedSpace5:1;
      uint64_t I2C3_bitfield:1;
      uint64_t LPTIM1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1RST:1;
      uint64_t I2C4RST:1;
      uint64_t reservedSpace0:6;
      uint64_t USBPDRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace0:10;
      uint64_t TIM1RST:1;
      uint64_t SPI1RST:1;
      uint64_t TIM8RST:1;
      uint64_t USART1RST:1;
      uint64_t SPI4RST:1;
      uint64_t TIM15RST:1;
      uint64_t TIM16RST:1;
      uint64_t TIM17RST:1;
      uint64_t reservedSpace1:1;
      uint64_t TIM20RST:1;
      uint64_t SAI1RST:1;
      uint64_t reservedSpace2:4;
      uint64_t HRTIM1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RSTR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1EN:1;
      uint64_t DMA2EN:1;
      uint64_t DMAMUXEN:1;
      uint64_t CORDICEN:1;
      uint64_t FMACEN:1;
      uint64_t reservedSpace0:3;
      uint64_t FLITFEN:1;
      uint64_t reservedSpace1:3;
      uint64_t CRCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOAEN:1;
      uint64_t GPIOBEN:1;
      uint64_t GPIOCEN:1;
      uint64_t GPIODEN:1;
      uint64_t GPIOEEN:1;
      uint64_t GPIOFEN:1;
      uint64_t GPIOGEN:1;
      uint64_t reservedSpace0:6;
      uint64_t ADC12EN:1;
      uint64_t ADC345EN:1;
      uint64_t reservedSpace1:1;
      uint64_t DAC1_bitfield:1;
      uint64_t DAC2_bitfield:1;
      uint64_t DAC3_bitfield:1;
      uint64_t DAC4_bitfield:1;
      uint64_t reservedSpace2:4;
      uint64_t CRYPTEN:1;
      uint64_t reservedSpace3:1;
      uint64_t RNGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCEN:1;
      uint64_t reservedSpace0:7;
      uint64_t QUADSPI1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3ENR;

