iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t TIM3EN:1;
      uint64_t TIM4EN:1;
      uint64_t TIM5EN:1;
      uint64_t TIM6EN:1;
      uint64_t TIM7EN:1;
      uint64_t reservedSpace0:2;
      uint64_t CRSEN:1;
      uint64_t reservedSpace1:1;
      uint64_t RTCAPBEN:1;
      uint64_t WWDGEN:1;
      uint64_t reservedSpace2:2;
      uint64_t SPI2EN:1;
      uint64_t SP3EN:1;
      uint64_t reservedSpace3:1;
      uint64_t USART2EN:1;
      uint64_t USART3EN:1;
      uint64_t UART4EN:1;
      uint64_t UART5EN:1;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t USBDEN:1;
      uint64_t reservedSpace4:1;
      uint64_t FDCANEN:1;
      uint64_t reservedSpace5:2;
      uint64_t PWREN:1;
      uint64_t reservedSpace6:1;
      uint64_t I2C3_bitfield:1;
      uint64_t LPTIM1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1EN:1;
      uint64_t I2C4EN:1;
      uint64_t reservedSpace0:6;
      uint64_t USBPDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace0:10;
      uint64_t TIM1EN:1;
      uint64_t SPI1EN:1;
      uint64_t TIM8EN:1;
      uint64_t USART1EN:1;
      uint64_t SPI4EN:1;
      uint64_t TIM15EN:1;
      uint64_t TIM16EN:1;
      uint64_t TIM17EN:1;
      uint64_t reservedSpace1:1;
      uint64_t TIM20EN:1;
      uint64_t SAI1EN:1;
      uint64_t reservedSpace2:4;
      uint64_t HRTIMEREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2ENR;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1SMEN:1;
      uint64_t DMA2SMEN:1;
      uint64_t DMAMUX1SMEN:1;
      uint64_t CORDICSMEN:1;
      uint64_t FMACSMEN:1;
      uint64_t reservedSpace0:3;
      uint64_t FLASHSMEN:1;
      uint64_t SRAM1SMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CRCSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOASMEN:1;
      uint64_t GPIOBSMEN:1;
      uint64_t GPIOCSMEN:1;
      uint64_t GPIODSMEN:1;
      uint64_t GPIOESMEN:1;
      uint64_t GPIOFSMEN:1;
      uint64_t GPIOGSMEN:1;
      uint64_t reservedSpace0:2;
      uint64_t SRAM2SMEN:1;
      uint64_t SRAM3SMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t AD12CSMEN:1;
      uint64_t ADC345SMEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DAC1SMEN:1;
      uint64_t DAC2SMEN:1;
      uint64_t DAC3SMEN:1;
      uint64_t DAC4SMEN:1;
      uint64_t reservedSpace3:4;
      uint64_t CRYPTSMEN:1;
      uint64_t reservedSpace4:1;
      uint64_t RNGSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCSMEN:1;
      uint64_t reservedSpace0:7;
      uint64_t QUADSPI1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3SMENR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2SMEN:1;
      uint64_t TIM3SMEN:1;
      uint64_t TIM4SMEN:1;
      uint64_t TIM5SMEN:1;
      uint64_t TIM6SMEN:1;
      uint64_t TIM7SMEN:1;
      uint64_t reservedSpace0:2;
      uint64_t CRSSMEN:1;
      uint64_t reservedSpace1:1;
      uint64_t RTCAPBSMEN:1;
      uint64_t WWDGSMEN:1;
      uint64_t reservedSpace2:2;
      uint64_t SPI2SMEN:1;
      uint64_t SP3SMEN:1;
      uint64_t reservedSpace3:1;
      uint64_t USART2SMEN:1;
      uint64_t USART3SMEN:1;
      uint64_t UART4SMEN:1;
      uint64_t UART5SMEN:1;
      uint64_t I2C1SMEN:1;
      uint64_t I2C2SMEN:1;
      uint64_t I2C3SMEN:1;
      uint64_t reservedSpace4:1;
      uint64_t FDCANSMEN:1;
      uint64_t reservedSpace5:2;
      uint64_t PWRSMEN:1;
      uint64_t reservedSpace6:1;
      uint64_t I2C3SMEN_3:1;
      uint64_t LPTIM1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1SMENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1SMEN:1;
      uint64_t I2C4SMEN:1;
      uint64_t reservedSpace0:6;
      uint64_t USBPDSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1SMENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGSMEN:1;
      uint64_t reservedSpace0:10;
      uint64_t TIM1SMEN:1;
      uint64_t SPI1SMEN:1;
      uint64_t TIM8SMEN:1;
      uint64_t USART1SMEN:1;
      uint64_t SPI4SMEN:1;
      uint64_t TIM15SMEN:1;
      uint64_t TIM16SMEN:1;
      uint64_t TIM17SMEN:1;
      uint64_t reservedSpace1:1;
      uint64_t TIM20SMEN:1;
      uint64_t SAI1SMEN:1;
      uint64_t reservedSpace2:4;
      uint64_t HRTIMERSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2SMENR;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART1SEL:2;
      uint64_t USART2SEL:2;
      uint64_t USART3SEL:2;
      uint64_t UART4SEL:2;
      uint64_t UART5SEL:2;
      uint64_t LPUART1SEL:2;
      uint64_t I2C1SEL:2;
      uint64_t I2C2SEL:2;
      uint64_t I2C3SEL:2;
      uint64_t LPTIM1SEL:2;
      uint64_t SAISEL:2;
      uint64_t SPISEL:2;
      uint64_t FDCANSEL:2;
      uint64_t CLK48SEL:2;
      uint64_t ADCSEL:2;
      uint64_t ADC345SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCIPR1;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSEON:1;
      uint64_t LSERDY:1;
      uint64_t LSEBYP:1;
      uint64_t LSEDRV:2;
      uint64_t LSECSSON:1;
      uint64_t LSECSSD:1;
      uint64_t reservedSpace0:1;
      uint64_t RTCSEL:2;
      uint64_t reservedSpace1:5;
      uint64_t RTCEN:1;
      uint64_t VSWRST:1;
      uint64_t reservedSpace2:7;
      uint64_t LSCCOEN:1;
      uint64_t LSCOSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSION:1;
      uint64_t LSIRDY:1;
      uint64_t reservedSpace0:21;
      uint64_t RMVF:1;
      uint64_t reservedSpace1:1;
      uint64_t OBLRSTF:1;
      uint64_t PADRSTF:1;
      uint64_t BORRSTF:1;
      uint64_t SFTRSTF:1;
      uint64_t WDGRSTF:1;
      uint64_t WWDGRSTF:1;
      uint64_t LPWRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RC48ON:1;
      uint64_t RC48RDY:1;
      uint64_t reservedSpace0:5;
      uint64_t RC48CAL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C4SEL:2;
      uint64_t reservedSpace0:18;
      uint64_t QUADSPISEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCIPR2;

