iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
};

#define RCC (*(volatile struct RCC_tag *) 0x40021000)

struct PWR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPMS:3;
      uint64_t reservedSpace0:5;
      uint64_t DBP:1;
      uint64_t VOS:2;
      uint64_t reservedSpace1:3;
      uint64_t LPR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PVDE:1;
      uint64_t PLS:3;
      uint64_t PVMEN1:1;
      uint64_t PVMEN2:1;
      uint64_t PVMEN3:1;
      uint64_t PVMEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWUP1:1;
      uint64_t EWUP2:1;
      uint64_t EWUP3:1;
      uint64_t EWUP4:1;
      uint64_t EWUP5:1;
      uint64_t reservedSpace0:3;
      uint64_t RRS:1;
      uint64_t reservedSpace1:1;
      uint64_t APC:1;
      uint64_t reservedSpace2:2;
      uint64_t UCPD1_STDBY:1;
      uint64_t UCPD1_DBDIS:1;
      uint64_t EIWUL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WP1:1;
      uint64_t WP2:1;
      uint64_t WP3:1;
      uint64_t WP4:1;
      uint64_t WP5:1;
      uint64_t reservedSpace0:3;
      uint64_t VBE:1;
      uint64_t VBRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUF1:1;
      uint64_t WUF2:1;
      uint64_t WUF3:1;
      uint64_t WUF4:1;
      uint64_t WUF5:1;
      uint64_t reservedSpace0:3;
      uint64_t SBF:1;
      uint64_t reservedSpace1:6;
      uint64_t WUFI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t REGLPS:1;
      uint64_t REGLPF:1;
      uint64_t VOSF:1;
      uint64_t PVDO:1;
      uint64_t PVMO1:1;
      uint64_t PVMO2:1;
      uint64_t PVMO3:1;
      uint64_t PVMO4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWUF1:1;
      uint64_t CWUF2:1;
      uint64_t CWUF3:1;
      uint64_t CWUF4:1;
      uint64_t CWUF5:1;
      uint64_t reservedSpace0:3;
      uint64_t CSBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t reservedSpace0:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t reservedSpace0:1;
      uint64_t PD14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t PU14:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t reservedSpace0:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t PU14:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t PU14:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t PU14:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t PU14:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRG;

  uint8_t res1[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R1MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR5;

