iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
};

#define SPI2 (*(volatile struct SPI2_tag *) 0x40003800)

struct EXTI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM0:1;
      uint64_t IM1:1;
      uint64_t IM2:1;
      uint64_t IM3:1;
      uint64_t IM4:1;
      uint64_t IM5:1;
      uint64_t IM6:1;
      uint64_t IM7:1;
      uint64_t IM8:1;
      uint64_t IM9:1;
      uint64_t IM10:1;
      uint64_t IM11:1;
      uint64_t IM12:1;
      uint64_t IM13:1;
      uint64_t IM14:1;
      uint64_t IM15:1;
      uint64_t IM16:1;
      uint64_t IM17:1;
      uint64_t IM18:1;
      uint64_t IM19:1;
      uint64_t IM20:1;
      uint64_t IM21:1;
      uint64_t IM22:1;
      uint64_t IM23:1;
      uint64_t IM24:1;
      uint64_t IM25:1;
      uint64_t IM26:1;
      uint64_t IM27:1;
      uint64_t IM28:1;
      uint64_t IM29:1;
      uint64_t IM30:1;
      uint64_t IM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0:1;
      uint64_t EM1:1;
      uint64_t EM2:1;
      uint64_t EM3:1;
      uint64_t EM4:1;
      uint64_t EM5:1;
      uint64_t EM6:1;
      uint64_t EM7:1;
      uint64_t EM8:1;
      uint64_t EM9:1;
      uint64_t EM10:1;
      uint64_t EM11:1;
      uint64_t EM12:1;
      uint64_t EM13:1;
      uint64_t EM14:1;
      uint64_t EM15:1;
      uint64_t EM16:1;
      uint64_t EM17:1;
      uint64_t EM18:1;
      uint64_t EM19:1;
      uint64_t EM20:1;
      uint64_t EM21:1;
      uint64_t EM22:1;
      uint64_t EM23:1;
      uint64_t EM24:1;
      uint64_t EM25:1;
      uint64_t EM26:1;
      uint64_t EM27:1;
      uint64_t EM28:1;
      uint64_t EM29:1;
      uint64_t EM30:1;
      uint64_t EM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RT0:1;
      uint64_t RT1:1;
      uint64_t RT2:1;
      uint64_t RT3:1;
      uint64_t RT4:1;
      uint64_t RT5:1;
      uint64_t RT6:1;
      uint64_t RT7:1;
      uint64_t RT8:1;
      uint64_t RT9:1;
      uint64_t RT10:1;
      uint64_t RT11:1;
      uint64_t RT12:1;
      uint64_t RT13:1;
      uint64_t RT14:1;
      uint64_t RT15:1;
      uint64_t RT16:1;
      uint64_t reservedSpace0:1;
      uint64_t RT18:1;
      uint64_t RT19:1;
      uint64_t RT20:1;
      uint64_t RT21:1;
      uint64_t RT22:1;
      uint64_t reservedSpace1:6;
      uint64_t RT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FT0:1;
      uint64_t FT1:1;
      uint64_t FT2:1;
      uint64_t FT3:1;
      uint64_t FT4:1;
      uint64_t FT5:1;
      uint64_t FT6:1;
      uint64_t FT7:1;
      uint64_t FT8:1;
      uint64_t FT9:1;
      uint64_t FT10:1;
      uint64_t FT11:1;
      uint64_t FT12:1;
      uint64_t FT13:1;
      uint64_t FT14:1;
      uint64_t FT15:1;
      uint64_t FT16:1;
      uint64_t reservedSpace0:1;
      uint64_t FT18:1;
      uint64_t FT19:1;
      uint64_t FT20:1;
      uint64_t FT21:1;
      uint64_t FT22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWI0:1;
      uint64_t SWI1:1;
      uint64_t SWI2:1;
      uint64_t SWI3:1;
      uint64_t SWI4:1;
      uint64_t SWI5:1;
      uint64_t SWI6:1;
      uint64_t SWI7:1;
      uint64_t SWI8:1;
      uint64_t SWI9:1;
      uint64_t SWI10:1;
      uint64_t SWI11:1;
      uint64_t SWI12:1;
      uint64_t SWI13:1;
      uint64_t SWI14:1;
      uint64_t SWI15:1;
      uint64_t SWI16:1;
      uint64_t reservedSpace0:1;
      uint64_t SWI18:1;
      uint64_t SWI19:1;
      uint64_t SWI20:1;
      uint64_t SWI21:1;
      uint64_t SWI22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIF0:1;
      uint64_t PIF1:1;
      uint64_t PIF2:1;
      uint64_t PIF3:1;
      uint64_t PIF4:1;
      uint64_t PIF5:1;
      uint64_t PIF6:1;
      uint64_t PIF7:1;
      uint64_t PIF8:1;
      uint64_t PIF9:1;
      uint64_t PIF10:1;
      uint64_t PIF11:1;
      uint64_t PIF12:1;
      uint64_t PIF13:1;
      uint64_t PIF14:1;
      uint64_t PIF15:1;
      uint64_t PIF16:1;
      uint64_t reservedSpace0:1;
      uint64_t PIF18:1;
      uint64_t PIF19:1;
      uint64_t PIF20:1;
      uint64_t PIF21:1;
      uint64_t PIF22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR1;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM32:1;
      uint64_t IM33:1;
      uint64_t IM34:1;
      uint64_t IM35:1;
      uint64_t IM36:1;
      uint64_t IM37:1;
      uint64_t IM38:1;
      uint64_t IM39:1;
      uint64_t IM40:1;
      uint64_t IM41:1;
      uint64_t IM42:1;
      uint64_t IM43:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM32:1;
      uint64_t EM33:1;
      uint64_t EM34:1;
      uint64_t EM35:1;
      uint64_t EM36:1;
      uint64_t EM37:1;
      uint64_t EM38:1;
      uint64_t EM39:1;
      uint64_t EM40:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RT32:1;
      uint64_t RT33:1;
      uint64_t reservedSpace0:4;
      uint64_t RT38:1;
      uint64_t RT39:1;
      uint64_t RT40:1;
      uint64_t RT41:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t FT35:1;
      uint64_t FT36:1;
      uint64_t FT37:1;
      uint64_t FT38:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t SWI35:1;
      uint64_t SWI36:1;
      uint64_t SWI37:1;
      uint64_t SWI38:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PIF35:1;
      uint64_t PIF36:1;
      uint64_t PIF37:1;
      uint64_t PIF38:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR2;

