iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
  uint8_t res0[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSOF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFR;

  uint8_t res1[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIG_ID:5;
      uint64_t reservedSpace0:3;
      uint64_t OIE:1;
      uint64_t reservedSpace1:7;
      uint64_t GE:1;
      uint64_t GPOL:2;
      uint64_t GNBREQ:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RG0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIG_ID:5;
      uint64_t reservedSpace0:3;
      uint64_t OIE:1;
      uint64_t reservedSpace1:7;
      uint64_t GE:1;
      uint64_t GPOL:2;
      uint64_t GNBREQ:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RG1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIG_ID:5;
      uint64_t reservedSpace0:3;
      uint64_t OIE:1;
      uint64_t reservedSpace1:7;
      uint64_t GE:1;
      uint64_t GPOL:2;
      uint64_t GNBREQ:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RG2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIG_ID:5;
      uint64_t reservedSpace0:3;
      uint64_t OIE:1;
      uint64_t reservedSpace1:7;
      uint64_t GE:1;
      uint64_t GPOL:2;
      uint64_t GNBREQ:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RG3CR;

  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGCFR;

};

#define DMAMUX (*(volatile struct DMAMUX_tag *) 0x40020800)

struct SYSCFG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEM_MODE:3;
      uint64_t reservedSpace0:5;
      uint64_t FB_mode:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEMRMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t BOOSTEN:1;
      uint64_t ANASWVDD:1;
      uint64_t reservedSpace1:6;
      uint64_t I2C_PB6_FMP:1;
      uint64_t I2C_PB7_FMP:1;
      uint64_t I2C_PB8_FMP:1;
      uint64_t I2C_PB9_FMP:1;
      uint64_t I2C1_FMP:1;
      uint64_t I2C2_FMP:1;
      uint64_t I2C3_FMP:1;
      uint64_t I2C4_FMP:1;
      uint64_t reservedSpace2:2;
      uint64_t FPU_IE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI0:4;
      uint64_t EXTI1:4;
      uint64_t EXTI2:4;
      uint64_t EXTI3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI4:4;
      uint64_t EXTI5:4;
      uint64_t EXTI6:4;
      uint64_t EXTI7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI8:4;
      uint64_t EXTI9:4;
      uint64_t EXTI10:4;
      uint64_t EXTI11:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI12:4;
      uint64_t EXTI13:4;
      uint64_t EXTI14:4;
      uint64_t EXTI15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCMER:1;
      uint64_t CCMBSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLL:1;
      uint64_t SPL:1;
      uint64_t PVDL:1;
      uint64_t ECCL:1;
      uint64_t reservedSpace0:4;
      uint64_t SPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Page0_WP:1;
      uint64_t Page1_WP:1;
      uint64_t Page2_WP:1;
      uint64_t Page3_WP:1;
      uint64_t Page4_WP:1;
      uint64_t Page5_WP:1;
      uint64_t Page6_WP:1;
      uint64_t Page7_WP:1;
      uint64_t Page8_WP:1;
      uint64_t Page9_WP:1;
      uint64_t Page10_WP:1;
      uint64_t Page11_WP:1;
      uint64_t Page12_WP:1;
      uint64_t Page13_WP:1;
      uint64_t Page14_WP:1;
      uint64_t Page15_WP:1;
      uint64_t Page16_WP:1;
      uint64_t Page17_WP:1;
      uint64_t Page18_WP:1;
      uint64_t Page19_WP:1;
      uint64_t Page20_WP:1;
      uint64_t Page21_WP:1;
      uint64_t Page22_WP:1;
      uint64_t Page23_WP:1;
      uint64_t Page24_WP:1;
      uint64_t Page25_WP:1;
      uint64_t Page26_WP:1;
      uint64_t Page27_WP:1;
      uint64_t Page28_WP:1;
      uint64_t Page29_WP:1;
      uint64_t Page30_WP:1;
      uint64_t Page31_WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SKR;

};

#define SYSCFG (*(volatile struct SYSCFG_tag *) 0x40010000)

struct VREFBUF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENVR:1;
      uint64_t HIZ:1;
      uint64_t reservedSpace0:1;
      uint64_t VRR:1;
      uint64_t VRS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFBUF_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFBUF_CCR;

};

#define VREFBUF (*(volatile struct VREFBUF_tag *) 0x40010030)

struct COMP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t COMP_DEGLITCH_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t INMSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t INPSEL:1;
      uint64_t reservedSpace2:6;
      uint64_t POL:1;
      uint64_t HYST:3;
      uint64_t BLANKSEL:3;
      uint64_t BRGEN:1;
      uint64_t SCALEN:1;
      uint64_t reservedSpace3:6;
      uint64_t VALUE:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP_C1CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t COMP_DEGLITCH_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t INMSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t INPSEL:1;
      uint64_t reservedSpace2:6;
      uint64_t POL:1;
      uint64_t HYST:3;
      uint64_t BLANKSEL:3;
      uint64_t BRGEN:1;
      uint64_t SCALEN:1;
      uint64_t reservedSpace3:6;
      uint64_t VALUE:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP_C2CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t COMP_DEGLITCH_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t INMSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t INPSEL:1;
      uint64_t reservedSpace2:6;
      uint64_t POL:1;
      uint64_t HYST:3;
      uint64_t BLANKSEL:3;
      uint64_t BRGEN:1;
      uint64_t SCALEN:1;
      uint64_t reservedSpace3:6;
      uint64_t VALUE:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP_C3CSR;

  uint8_t res0[6];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t COMP_DEGLITCH_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t INMSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t INPSEL:1;
      uint64_t reservedSpace2:6;
      uint64_t POL:1;
      uint64_t HYST:3;
      uint64_t BLANKSEL:3;
      uint64_t BRGEN:1;
      uint64_t SCALEN:1;
      uint64_t reservedSpace3:6;
      uint64_t VALUE:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP_C4CSR;

