iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
};

#define DAC2 (*(volatile struct DAC2_tag *) 0x50000c00)

struct DAC3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN1:1;
      uint64_t TEN1:1;
      uint64_t TSEL1:4;
      uint64_t WAVE1:2;
      uint64_t MAMP1:4;
      uint64_t DMAEN1:1;
      uint64_t DMAUDRIE1:1;
      uint64_t CEN1:1;
      uint64_t reservedSpace0:1;
      uint64_t EN2:1;
      uint64_t TEN2:1;
      uint64_t TSEL2:4;
      uint64_t WAVE2:2;
      uint64_t MAMP2:4;
      uint64_t DMAEN2:1;
      uint64_t DMAUDRIE2:1;
      uint64_t CEN2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWTRIG1:1;
      uint64_t SWTRIG2:1;
      uint64_t reservedSpace0:14;
      uint64_t SWTRIGB1:1;
      uint64_t SWTRIGB2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SWTRGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DHR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC1DHRB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DACC1DHR:12;
      uint64_t reservedSpace1:4;
      uint64_t DACC1DHRB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12L1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DHR:8;
      uint64_t DACC1DHRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR8R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC2DHR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC2DHRB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DACC2DHR:12;
      uint64_t reservedSpace1:4;
      uint64_t DACC2DHRB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12L2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC2DHR:8;
      uint64_t DACC2DHRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR8R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DHR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC2DHR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12RD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DACC1DHR:12;
      uint64_t reservedSpace1:4;
      uint64_t DACC2DHR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12LD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DHR:8;
      uint64_t DACC2DHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR8RD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DOR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC1DORB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DOR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC2DOR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC2DORB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DOR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t DAC1RDY:1;
      uint64_t DORSTAT1:1;
      uint64_t DMAUDR1:1;
      uint64_t CAL_FLAG1:1;
      uint64_t BWST1:1;
      uint64_t reservedSpace1:11;
      uint64_t DAC2RDY:1;
      uint64_t DORSTAT2:1;
      uint64_t DMAUDR2:1;
      uint64_t CAL_FLAG2:1;
      uint64_t BWST2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTRIM1:5;
      uint64_t reservedSpace0:11;
      uint64_t OTRIM2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE1:3;
      uint64_t reservedSpace0:5;
      uint64_t DMADOUBLE1:1;
      uint64_t SINFORMAT1:1;
      uint64_t reservedSpace1:4;
      uint64_t HFSEL:2;
      uint64_t MODE2:3;
      uint64_t reservedSpace2:5;
      uint64_t DMADOUBLE2:1;
      uint64_t SINFORMAT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSAMPLE1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SHSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSAMPLE2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SHSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THOLD1:10;
      uint64_t reservedSpace0:6;
      uint64_t THOLD2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SHHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TREFRESH1:8;
      uint64_t reservedSpace0:8;
      uint64_t TREFRESH2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SHRR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRSTDATA1:12;
      uint64_t STDIR1:1;
      uint64_t reservedSpace0:3;
      uint64_t STINCDATA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_STR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRSTDATA2:12;
      uint64_t STDIR2:1;
      uint64_t reservedSpace0:3;
      uint64_t STINCDATA2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_STR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRSTTRIGSEL1:4;
      uint64_t reservedSpace0:4;
      uint64_t STINCTRIGSEL1:4;
      uint64_t reservedSpace1:4;
      uint64_t STRSTTRIGSEL2:4;
      uint64_t reservedSpace2:4;
      uint64_t STINCTRIGSEL2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_STMODR;

};

#define DAC3 (*(volatile struct DAC3_tag *) 0x50001000)

struct DAC4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN1:1;
      uint64_t TEN1:1;
      uint64_t TSEL1:4;
      uint64_t WAVE1:2;
      uint64_t MAMP1:4;
      uint64_t DMAEN1:1;
      uint64_t DMAUDRIE1:1;
      uint64_t CEN1:1;
      uint64_t reservedSpace0:1;
      uint64_t EN2:1;
      uint64_t TEN2:1;
      uint64_t TSEL2:4;
      uint64_t WAVE2:2;
      uint64_t MAMP2:4;
      uint64_t DMAEN2:1;
      uint64_t DMAUDRIE2:1;
      uint64_t CEN2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWTRIG1:1;
      uint64_t SWTRIG2:1;
      uint64_t reservedSpace0:14;
      uint64_t SWTRIGB1:1;
      uint64_t SWTRIGB2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SWTRGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DHR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC1DHRB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DACC1DHR:12;
      uint64_t reservedSpace1:4;
      uint64_t DACC1DHRB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12L1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DHR:8;
      uint64_t DACC1DHRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR8R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC2DHR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC2DHRB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DACC2DHR:12;
      uint64_t reservedSpace1:4;
      uint64_t DACC2DHRB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12L2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC2DHR:8;
      uint64_t DACC2DHRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR8R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DHR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC2DHR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12RD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DACC1DHR:12;
      uint64_t reservedSpace1:4;
      uint64_t DACC2DHR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR12LD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DHR:8;
      uint64_t DACC2DHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DHR8RD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC1DOR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC1DORB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DOR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACC2DOR:12;
      uint64_t reservedSpace0:4;
      uint64_t DACC2DORB:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_DOR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t DAC1RDY:1;
      uint64_t DORSTAT1:1;
      uint64_t DMAUDR1:1;
      uint64_t CAL_FLAG1:1;
      uint64_t BWST1:1;
      uint64_t reservedSpace1:11;
      uint64_t DAC2RDY:1;
      uint64_t DORSTAT2:1;
      uint64_t DMAUDR2:1;
      uint64_t CAL_FLAG2:1;
      uint64_t BWST2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTRIM1:5;
      uint64_t reservedSpace0:11;
      uint64_t OTRIM2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE1:3;
      uint64_t reservedSpace0:5;
      uint64_t DMADOUBLE1:1;
      uint64_t SINFORMAT1:1;
      uint64_t reservedSpace1:4;
      uint64_t HFSEL:2;
      uint64_t MODE2:3;
      uint64_t reservedSpace2:5;
      uint64_t DMADOUBLE2:1;
      uint64_t SINFORMAT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSAMPLE1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SHSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSAMPLE2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SHSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THOLD1:10;
      uint64_t reservedSpace0:6;
      uint64_t THOLD2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SHHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TREFRESH1:8;
      uint64_t reservedSpace0:8;
      uint64_t TREFRESH2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SHRR;

