iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRSTDATA1:12;
      uint64_t STDIR1:1;
      uint64_t reservedSpace0:3;
      uint64_t STINCDATA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_STR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRSTDATA2:12;
      uint64_t STDIR2:1;
      uint64_t reservedSpace0:3;
      uint64_t STINCDATA2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_STR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRSTTRIGSEL1:4;
      uint64_t reservedSpace0:4;
      uint64_t STINCTRIGSEL1:4;
      uint64_t reservedSpace1:4;
      uint64_t STRSTTRIGSEL2:4;
      uint64_t reservedSpace2:4;
      uint64_t STINCTRIGSEL2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_STMODR;

};

#define DAC4 (*(volatile struct DAC4_tag *) 0x50001400)

struct ADC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRDY:1;
      uint64_t EOSMP:1;
      uint64_t EOC:1;
      uint64_t EOS:1;
      uint64_t OVR:1;
      uint64_t JEOC:1;
      uint64_t JEOS:1;
      uint64_t AWD1:1;
      uint64_t AWD2:1;
      uint64_t AWD3:1;
      uint64_t JQOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRDYIE:1;
      uint64_t EOSMPIE:1;
      uint64_t EOCIE:1;
      uint64_t EOSIE:1;
      uint64_t OVRIE:1;
      uint64_t JEOCIE:1;
      uint64_t JEOSIE:1;
      uint64_t AWD1IE:1;
      uint64_t AWD2IE:1;
      uint64_t AWD3IE:1;
      uint64_t JQOVFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEN:1;
      uint64_t ADDIS:1;
      uint64_t ADSTART:1;
      uint64_t JADSTART:1;
      uint64_t ADSTP:1;
      uint64_t JADSTP:1;
      uint64_t reservedSpace0:22;
      uint64_t ADVREGEN:1;
      uint64_t DEEPPWD:1;
      uint64_t ADCALDIF:1;
      uint64_t ADCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t DMACFG:1;
      uint64_t reservedSpace0:1;
      uint64_t RES:2;
      uint64_t ALIGN_5:1;
      uint64_t EXTSEL:4;
      uint64_t EXTEN:2;
      uint64_t OVRMOD:1;
      uint64_t CONT:1;
      uint64_t AUTDLY:1;
      uint64_t ALIGN:1;
      uint64_t DISCEN:1;
      uint64_t DISCNUM:3;
      uint64_t JDISCEN:1;
      uint64_t JQM:1;
      uint64_t AWD1SGL:1;
      uint64_t AWD1EN:1;
      uint64_t JAWD1EN:1;
      uint64_t JAUTO:1;
      uint64_t AWDCH1CH:5;
      uint64_t JQDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROVSE:1;
      uint64_t JOVSE:1;
      uint64_t OVSR:3;
      uint64_t OVSS:4;
      uint64_t TROVS:1;
      uint64_t ROVSM:1;
      uint64_t reservedSpace0:5;
      uint64_t GCOMP:1;
      uint64_t reservedSpace1:8;
      uint64_t SWTRIG:1;
      uint64_t BULB:1;
      uint64_t SMPTRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMP0:3;
      uint64_t SMP1:3;
      uint64_t SMP2:3;
      uint64_t SMP3:3;
      uint64_t SMP4:3;
      uint64_t SMP5:3;
      uint64_t SMP6:3;
      uint64_t SMP7:3;
      uint64_t SMP8:3;
      uint64_t SMP9:3;
      uint64_t reservedSpace0:1;
      uint64_t SMPPLUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMP10:3;
      uint64_t SMP11:3;
      uint64_t SMP12:3;
      uint64_t SMP13:3;
      uint64_t SMP14:3;
      uint64_t SMP15:3;
      uint64_t SMP16:3;
      uint64_t SMP17:3;
      uint64_t SMP18:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LT1:12;
      uint64_t AWDFILT:3;
      uint64_t reservedSpace0:1;
      uint64_t HT1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LT2:8;
      uint64_t reservedSpace0:8;
      uint64_t HT2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LT3:8;
      uint64_t reservedSpace0:8;
      uint64_t HT3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR3;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L:4;
      uint64_t reservedSpace0:2;
      uint64_t SQ1:5;
      uint64_t reservedSpace1:1;
      uint64_t SQ2:5;
      uint64_t reservedSpace2:1;
      uint64_t SQ3:5;
      uint64_t reservedSpace3:1;
      uint64_t SQ4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SQR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQ5:5;
      uint64_t reservedSpace0:1;
      uint64_t SQ6:5;
      uint64_t reservedSpace1:1;
      uint64_t SQ7:5;
      uint64_t reservedSpace2:1;
      uint64_t SQ8:5;
      uint64_t reservedSpace3:1;
      uint64_t SQ9:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SQR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQ10:5;
      uint64_t reservedSpace0:1;
      uint64_t SQ11:5;
      uint64_t reservedSpace1:1;
      uint64_t SQ12:5;
      uint64_t reservedSpace2:1;
      uint64_t SQ13:5;
      uint64_t reservedSpace3:1;
      uint64_t SQ14:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SQR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQ15:5;
      uint64_t reservedSpace0:1;
      uint64_t SQ16:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SQR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JL:2;
      uint64_t JEXTSEL:5;
      uint64_t JEXTEN:2;
      uint64_t JSQ1:5;
      uint64_t reservedSpace0:1;
      uint64_t JSQ2:5;
      uint64_t reservedSpace1:1;
      uint64_t JSQ3:5;
      uint64_t reservedSpace2:1;
      uint64_t JSQ4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JSQR;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET1:12;
      uint64_t reservedSpace0:12;
      uint64_t OFFSETPOS:1;
      uint64_t SATEN:1;
      uint64_t OFFSET1_CH:5;
      uint64_t OFFSET1_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET1:12;
      uint64_t reservedSpace0:12;
      uint64_t OFFSETPOS:1;
      uint64_t SATEN:1;
      uint64_t OFFSET1_CH:5;
      uint64_t OFFSET1_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET1:12;
      uint64_t reservedSpace0:12;
      uint64_t OFFSETPOS:1;
      uint64_t SATEN:1;
      uint64_t OFFSET1_CH:5;
      uint64_t OFFSET1_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET1:12;
      uint64_t reservedSpace0:12;
      uint64_t OFFSETPOS:1;
      uint64_t SATEN:1;
      uint64_t OFFSET1_CH:5;
      uint64_t OFFSET1_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR4;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR4;

