iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWD2CH:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWD2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWD3CH:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWD3CR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIFSEL_0:1;
      uint64_t DIFSEL_1_18:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIFSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALFACT_S:7;
      uint64_t reservedSpace0:9;
      uint64_t CALFACT_D:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALFACT;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOMPCOEFF:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCOMP;

};

#define ADC3 (*(volatile struct ADC3_tag *) 0x50000400)

struct ADC12_Common_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRDY_MST:1;
      uint64_t EOSMP_MST:1;
      uint64_t EOC_MST:1;
      uint64_t EOS_MST:1;
      uint64_t OVR_MST:1;
      uint64_t JEOC_MST:1;
      uint64_t JEOS_MST:1;
      uint64_t AWD1_MST:1;
      uint64_t AWD2_MST:1;
      uint64_t AWD3_MST:1;
      uint64_t JQOVF_MST:1;
      uint64_t reservedSpace0:5;
      uint64_t ADRDY_SLV:1;
      uint64_t EOSMP_SLV:1;
      uint64_t EOC_SLV:1;
      uint64_t EOS_SLV:1;
      uint64_t OVR_SLV:1;
      uint64_t JEOC_SLV:1;
      uint64_t JEOS_SLV:1;
      uint64_t AWD1_SLV:1;
      uint64_t AWD2_SLV:1;
      uint64_t AWD3_SLV:1;
      uint64_t JQOVF_SLV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUAL:5;
      uint64_t reservedSpace0:3;
      uint64_t DELAY:4;
      uint64_t reservedSpace1:1;
      uint64_t DMACFG:1;
      uint64_t MDMA:2;
      uint64_t CKMODE:2;
      uint64_t PRESC:4;
      uint64_t VREFEN:1;
      uint64_t CH17SEL:1;
      uint64_t CH18SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA_MST:16;
      uint64_t RDATA_SLV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

};

#define ADC12_Common (*(volatile struct ADC12_Common_tag *) 0x50000300)

struct ADC345_Common_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRDY_MST:1;
      uint64_t EOSMP_MST:1;
      uint64_t EOC_MST:1;
      uint64_t EOS_MST:1;
      uint64_t OVR_MST:1;
      uint64_t JEOC_MST:1;
      uint64_t JEOS_MST:1;
      uint64_t AWD1_MST:1;
      uint64_t AWD2_MST:1;
      uint64_t AWD3_MST:1;
      uint64_t JQOVF_MST:1;
      uint64_t reservedSpace0:5;
      uint64_t ADRDY_SLV:1;
      uint64_t EOSMP_SLV:1;
      uint64_t EOC_SLV:1;
      uint64_t EOS_SLV:1;
      uint64_t OVR_SLV:1;
      uint64_t JEOC_SLV:1;
      uint64_t JEOS_SLV:1;
      uint64_t AWD1_SLV:1;
      uint64_t AWD2_SLV:1;
      uint64_t AWD3_SLV:1;
      uint64_t JQOVF_SLV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUAL:5;
      uint64_t reservedSpace0:3;
      uint64_t DELAY:4;
      uint64_t reservedSpace1:1;
      uint64_t DMACFG:1;
      uint64_t MDMA:2;
      uint64_t CKMODE:2;
      uint64_t PRESC:4;
      uint64_t VREFEN:1;
      uint64_t CH17SEL:1;
      uint64_t CH18SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA_MST:16;
      uint64_t RDATA_SLV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

};

#define ADC345_Common (*(volatile struct ADC345_Common_tag *) 0x50000700)

struct FMAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t X1_BASE:8;
      uint64_t X1_BUF_SIZE:8;
      uint64_t reservedSpace0:8;
      uint64_t FULL_WM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) X1BUFCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t X2_BASE:8;
      uint64_t X2_BUF_SIZE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) X2BUFCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Y_BASE:8;
      uint64_t Y_BUF_SIZE:8;
      uint64_t reservedSpace0:8;
      uint64_t EMPTY_WM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) YBUFCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P:8;
      uint64_t Q:8;
      uint64_t R:8;
      uint64_t FUNC:7;
      uint64_t START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIEN:1;
      uint64_t WIEN:1;
      uint64_t OVFLIEN:1;
      uint64_t UNFLIEN:1;
      uint64_t SATIEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DMAREN:1;
      uint64_t DMAWEN:1;
      uint64_t reservedSpace1:5;
      uint64_t CLIPEN:1;
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YEMPTY:1;
      uint64_t X1FULL:1;
      uint64_t reservedSpace0:6;
      uint64_t OVFL:1;
      uint64_t UNFL:1;
      uint64_t SAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDATA;

};

#define FMAC (*(volatile struct FMAC_tag *) 0x40021400)

struct CORDIC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t PRECISION:4;
      uint64_t SCALE:3;
      uint64_t reservedSpace0:5;
      uint64_t IEN:1;
      uint64_t DMAREN:1;
      uint64_t DMAWEN:1;
      uint64_t NRES:1;
      uint64_t NARGS:1;
      uint64_t RESSIZE:1;
      uint64_t ARGSIZE:1;
      uint64_t reservedSpace1:8;
      uint64_t RRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDATA;

