iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
};

#define CORDIC (*(volatile struct CORDIC_tag *) 0x40020c00)

struct SAI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t PRTCFG:2;
      uint64_t reservedSpace0:1;
      uint64_t DS:3;
      uint64_t LSBFIRST:1;
      uint64_t CKSTR:1;
      uint64_t SYNCEN:2;
      uint64_t MONO:1;
      uint64_t OutDri:1;
      uint64_t reservedSpace1:2;
      uint64_t SAIAEN:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace2:1;
      uint64_t NODIV:1;
      uint64_t MCJDIV:6;
      uint64_t OSR:1;
      uint64_t MCKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:3;
      uint64_t FFLUS:1;
      uint64_t TRIS:1;
      uint64_t MUTE:1;
      uint64_t MUTEVAL:1;
      uint64_t MUTECN:6;
      uint64_t CPL:1;
      uint64_t COMP_bitfield:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRL:8;
      uint64_t FSALL:7;
      uint64_t reservedSpace0:1;
      uint64_t FSDEF:1;
      uint64_t FSPOL:1;
      uint64_t FSOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FBOFF:5;
      uint64_t reservedSpace0:1;
      uint64_t SLOTSZ:2;
      uint64_t NBSLOT:4;
      uint64_t reservedSpace1:4;
      uint64_t SLOTEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASLOTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRUDRIE:1;
      uint64_t MUTEDET:1;
      uint64_t WCKCFG:1;
      uint64_t FREQIE:1;
      uint64_t CNRDYIE:1;
      uint64_t AFSDETIE:1;
      uint64_t LFSDET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRUDR:1;
      uint64_t MUTEDET:1;
      uint64_t WCKCFG:1;
      uint64_t FREQ:1;
      uint64_t CNRDY:1;
      uint64_t AFSDET:1;
      uint64_t LFSDET:1;
      uint64_t reservedSpace0:9;
      uint64_t FLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRUDR:1;
      uint64_t MUTEDET:1;
      uint64_t WCKCFG:1;
      uint64_t reservedSpace0:1;
      uint64_t CNRDY:1;
      uint64_t CAFSDET:1;
      uint64_t LFSDET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACLRFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t PRTCFG:2;
      uint64_t reservedSpace0:1;
      uint64_t DS:3;
      uint64_t LSBFIRST:1;
      uint64_t CKSTR:1;
      uint64_t SYNCEN:2;
      uint64_t MONO:1;
      uint64_t OutDri:1;
      uint64_t reservedSpace1:2;
      uint64_t SAIBEN:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace2:1;
      uint64_t NODIV:1;
      uint64_t MCJDIV:6;
      uint64_t OSR:1;
      uint64_t MCKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:3;
      uint64_t FFLUS:1;
      uint64_t TRIS:1;
      uint64_t MUTE:1;
      uint64_t MUTEVAL:1;
      uint64_t MUTECN:6;
      uint64_t CPL:1;
      uint64_t COMP_bitfield:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRL:8;
      uint64_t FSALL:7;
      uint64_t reservedSpace0:1;
      uint64_t FSDEF:1;
      uint64_t FSPOL:1;
      uint64_t FSOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BFRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FBOFF:5;
      uint64_t reservedSpace0:1;
      uint64_t SLOTSZ:2;
      uint64_t NBSLOT:4;
      uint64_t reservedSpace1:4;
      uint64_t SLOTEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BSLOTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRUDRIE:1;
      uint64_t MUTEDET:1;
      uint64_t WCKCFG:1;
      uint64_t FREQIE:1;
      uint64_t CNRDYIE:1;
      uint64_t AFSDETIE:1;
      uint64_t LFSDETIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRUDR:1;
      uint64_t MUTEDET:1;
      uint64_t WCKCFG:1;
      uint64_t FREQ:1;
      uint64_t CNRDY:1;
      uint64_t AFSDET:1;
      uint64_t LFSDET:1;
      uint64_t reservedSpace0:9;
      uint64_t FLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRUDR:1;
      uint64_t MUTEDET:1;
      uint64_t WCKCFG:1;
      uint64_t reservedSpace0:1;
      uint64_t CNRDY:1;
      uint64_t CAFSDET:1;
      uint64_t LFSDET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCLRFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDMEN:1;
      uint64_t reservedSpace0:3;
      uint64_t MICNBR:2;
      uint64_t reservedSpace1:2;
      uint64_t CKEN1:1;
      uint64_t CKEN2:1;
      uint64_t CKEN3:1;
      uint64_t CKEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLYM1L:3;
      uint64_t reservedSpace0:1;
      uint64_t DLYM1R:3;
      uint64_t reservedSpace1:1;
      uint64_t DLYM2L:3;
      uint64_t reservedSpace2:1;
      uint64_t DLYM2R:3;
      uint64_t reservedSpace3:1;
      uint64_t DLYM3L:3;
      uint64_t reservedSpace4:1;
      uint64_t DLYM3R:3;
      uint64_t reservedSpace5:1;
      uint64_t DLYM4L:3;
      uint64_t reservedSpace6:1;
      uint64_t DLYM4R:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMDLY;

};

#define SAI (*(volatile struct SAI_tag *) 0x40015404)

struct TAMP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP1E:1;
      uint64_t TAMP2E:1;
      uint64_t TAMP3E:1;
      uint64_t reservedSpace0:15;
      uint64_t ITAMP3E:1;
      uint64_t ITAMP4E:1;
      uint64_t ITAMP5E:1;
      uint64_t ITAMP6E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP1NOER:1;
      uint64_t TAMP2NOER:1;
      uint64_t TAMP3NOER:1;
      uint64_t reservedSpace0:13;
      uint64_t TAMP1MSK:1;
      uint64_t TAMP2MSK:1;
      uint64_t TAMP3MSK:1;
      uint64_t reservedSpace1:5;
      uint64_t TAMP1TRG:1;
      uint64_t TAMP2TRG:1;
      uint64_t TAMP3TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

