iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0N:1;
      uint64_t RF0W:1;
      uint64_t RF0F:1;
      uint64_t RF0L:1;
      uint64_t RF1N:1;
      uint64_t RF1W:1;
      uint64_t RF1F:1;
      uint64_t RF1L:1;
      uint64_t HPM:1;
      uint64_t TC:1;
      uint64_t TCF:1;
      uint64_t TFE:1;
      uint64_t TEFN:1;
      uint64_t TEFW:1;
      uint64_t TEFF:1;
      uint64_t TEFL:1;
      uint64_t TSW:1;
      uint64_t MRAF:1;
      uint64_t TOO:1;
      uint64_t DRX:1;
      uint64_t reservedSpace0:2;
      uint64_t ELO:1;
      uint64_t EP:1;
      uint64_t EW:1;
      uint64_t BO:1;
      uint64_t WDI:1;
      uint64_t PEA:1;
      uint64_t PED:1;
      uint64_t ARA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0NE:1;
      uint64_t RF0WE:1;
      uint64_t RF0FE:1;
      uint64_t RF0LE:1;
      uint64_t RF1NE:1;
      uint64_t RF1WE:1;
      uint64_t RF1FE:1;
      uint64_t RF1LE:1;
      uint64_t HPME:1;
      uint64_t TCE:1;
      uint64_t TCFE:1;
      uint64_t TFEE:1;
      uint64_t TEFNE:1;
      uint64_t TEFWE:1;
      uint64_t TEFFE:1;
      uint64_t TEFLE:1;
      uint64_t TSWE:1;
      uint64_t MRAFE:1;
      uint64_t TOOE:1;
      uint64_t DRX:1;
      uint64_t BECE:1;
      uint64_t BEUE:1;
      uint64_t ELOE:1;
      uint64_t EPE:1;
      uint64_t EWE:1;
      uint64_t BOE:1;
      uint64_t WDIE:1;
      uint64_t PEAE:1;
      uint64_t PEDE:1;
      uint64_t ARAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0NL:1;
      uint64_t RF0WL:1;
      uint64_t RF0FL:1;
      uint64_t RF0LL:1;
      uint64_t RF1NL:1;
      uint64_t RF1WL:1;
      uint64_t RF1FL:1;
      uint64_t RF1LL:1;
      uint64_t HPML:1;
      uint64_t TCL:1;
      uint64_t TCFL:1;
      uint64_t TFEL:1;
      uint64_t TEFNL:1;
      uint64_t TEFWL:1;
      uint64_t TEFFL:1;
      uint64_t TEFLL:1;
      uint64_t TSWL:1;
      uint64_t MRAFL:1;
      uint64_t TOOL:1;
      uint64_t DRXL:1;
      uint64_t BECL:1;
      uint64_t BEUL:1;
      uint64_t ELOL:1;
      uint64_t EPL:1;
      uint64_t EWL:1;
      uint64_t BOL:1;
      uint64_t WDIL:1;
      uint64_t PEAL:1;
      uint64_t PEDL:1;
      uint64_t ARAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ILS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EINT0:1;
      uint64_t EINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ILE;

  uint8_t res3[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RRFE:1;
      uint64_t RRFS:1;
      uint64_t ANFE:2;
      uint64_t ANFS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXGFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIDM:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XIDAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIDX:6;
      uint64_t MSI:2;
      uint64_t FIDX:7;
      uint64_t FLST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPMS;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F0GI:6;
      uint64_t reservedSpace1:2;
      uint64_t F0PI:6;
      uint64_t reservedSpace2:2;
      uint64_t F0F:1;
      uint64_t RF0L:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0AI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F1GI:6;
      uint64_t reservedSpace1:2;
      uint64_t F1PI:6;
      uint64_t reservedSpace2:2;
      uint64_t F1F:1;
      uint64_t RF1L:1;
      uint64_t reservedSpace3:4;
      uint64_t DMS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1AI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1A;

  uint8_t res5[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TBSA:14;
      uint64_t NDTB:6;
      uint64_t reservedSpace1:2;
      uint64_t TFQS:6;
      uint64_t TFQM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t TFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t TFQPI:5;
      uint64_t TFQF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFQS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBTIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t EFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t EFPI:5;
      uint64_t reservedSpace2:3;
      uint64_t EFF:1;
      uint64_t TEFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFAI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFA;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKDIV;

