iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G474/targetInit/stm32g4_sfr.h
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F0GI:6;
      uint64_t reservedSpace1:2;
      uint64_t F0PI:6;
      uint64_t reservedSpace2:2;
      uint64_t F0F:1;
      uint64_t RF0L:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0AI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F1GI:6;
      uint64_t reservedSpace1:2;
      uint64_t F1PI:6;
      uint64_t reservedSpace2:2;
      uint64_t F1F:1;
      uint64_t RF1L:1;
      uint64_t reservedSpace3:4;
      uint64_t DMS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1AI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1A;

  uint8_t res5[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TBSA:14;
      uint64_t NDTB:6;
      uint64_t reservedSpace1:2;
      uint64_t TFQS:6;
      uint64_t TFQM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t TFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t TFQPI:5;
      uint64_t TFQF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFQS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBTIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t EFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t EFPI:5;
      uint64_t reservedSpace2:3;
      uint64_t EFF:1;
      uint64_t TEFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFAI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFA;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKDIV;

};

#define FDCAN2 (*(volatile struct FDCAN2_tag *) 0x40006800)

struct UCPD1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBITCLKDIV:6;
      uint64_t IFRGAP:5;
      uint64_t TRANSWIN:5;
      uint64_t reservedSpace0:1;
      uint64_t PSC_USBPDCLK:3;
      uint64_t RXORDSETEN:9;
      uint64_t TXDMAEN:1;
      uint64_t RXDMAEN:1;
      uint64_t UCPDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFILTDIS:1;
      uint64_t RXFILT2N3:1;
      uint64_t FORCECLK:1;
      uint64_t WUPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMODE:2;
      uint64_t TXSEND:1;
      uint64_t TXHRST:1;
      uint64_t RXMODE:1;
      uint64_t PHYRXEN:1;
      uint64_t PHYCCSEL:1;
      uint64_t ANASUBMODE:2;
      uint64_t ANAMODE:1;
      uint64_t CCENABLE:2;
      uint64_t reservedSpace0:4;
      uint64_t FRSRXEN:1;
      uint64_t FRSTX:1;
      uint64_t RDCH:1;
      uint64_t reservedSpace1:1;
      uint64_t CC1TCDIS:1;
      uint64_t CC2TCDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXISIE:1;
      uint64_t TXMSGDISCIE:1;
      uint64_t TXMSGSENTIE:1;
      uint64_t TXMSGABTIE:1;
      uint64_t HRSTDISCIE:1;
      uint64_t HRSTSENTIE:1;
      uint64_t TXUNDIE:1;
      uint64_t reservedSpace0:1;
      uint64_t RXNEIE:1;
      uint64_t RXORDDETIE:1;
      uint64_t RXHRSTDETIE:1;
      uint64_t RXOVRIE:1;
      uint64_t RXMSGENDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t TYPECEVT1IE:1;
      uint64_t TYPECEVT2IE:1;
      uint64_t reservedSpace2:4;
      uint64_t FRSEVTIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXIS:1;
      uint64_t TXMSGDISC:1;
      uint64_t TXMSGSENT:1;
      uint64_t TXMSGABT:1;
      uint64_t HRSTDISC:1;
      uint64_t HRSTSENT:1;
      uint64_t TXUND:1;
      uint64_t reservedSpace0:1;
      uint64_t RXNE:1;
      uint64_t RXORDDET:1;
      uint64_t RXHRSTDET:1;
      uint64_t RXOVR:1;
      uint64_t RXMSGEND:1;
      uint64_t RXERR:1;
      uint64_t TYPECEVT1:1;
      uint64_t TYPECEVT2:1;
      uint64_t TYPEC_VSTATE_CC1:2;
      uint64_t TYPEC_VSTATE_CC2:2;
      uint64_t FRSEVT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TXMSGDISCCF:1;
      uint64_t TXMSGSENTCF:1;
      uint64_t TXMSGABTCF:1;
      uint64_t HRSTDISCCF:1;
      uint64_t HRSTSENTCF:1;
      uint64_t TXUNDCF:1;
      uint64_t reservedSpace1:2;
      uint64_t RXORDDETCF:1;
      uint64_t RXHRSTDETCF:1;
      uint64_t RXOVRCF:1;
      uint64_t RXMSGENDCF:1;
      uint64_t reservedSpace2:1;
      uint64_t TYPECEVT1CF:1;
      uint64_t TYPECEVT2CF:1;
      uint64_t reservedSpace3:4;
      uint64_t FRSEVTCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXORDSET:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_ORDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPAYSZ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PAYSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXORDSET:3;
      uint64_t RXSOP3OF4:1;
      uint64_t RXSOPKINVALID:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPAYSZ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_PAYSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSOPX1:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDEXT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSOPX2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDEXT2;

